# Pandas - DataFrames

In [23]:
import numpy as np
import pandas as pd

In [24]:
from numpy.random import randn

In [25]:
np.random.seed(101)

In [26]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

>__each column is a pd series__

In [28]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [29]:
type(df['W'])

pandas.core.series.Series

In [30]:
type(df)

pandas.core.frame.DataFrame

In [31]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

>__You could query multiple Columns__

In [32]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

>__Code below will cause errors__

In [33]:
df['new'] = df['W'] + df['Y']

In [34]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

>__You have to mention the exact axis when dropping columns__

>__However the changes do not stay__

In [35]:
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

>__You have to include 'inplace=True' for the results to stay in place__

In [37]:
df.drop('new', axis=1, inplace=True)

In [38]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

>__the default axis is 0__

In [39]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

>__axis numbering comes from the shape__

In [41]:
df.shape

(5, 4)

>__Selecting Rows__

>> __From this, you could see that the rows are also series__

In [42]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [45]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

>__You could also access a particular element from DFs__

In [47]:
df.loc['A','Y']

0.9079694464765431

In [50]:
df.loc[["A","B"],["W","Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# Pandas - DataFrames

In [52]:
booldf = df>0

In [53]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [55]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

>__Select the rows which only satisfies the conditions__

In [60]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [61]:
result_df = df[df['W']>0]

In [62]:
result_df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

>__Carry out multiple steps through one command__

In [63]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [68]:
boolser = df['W']>0
result = df[boolser]

In [71]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
result[['Y',"Z"]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

>__The below code will not work because there are multiple booleans to be compared__

In [72]:
df[df['W']>0 and df['Z']<0]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

>__you have to work like this:__

In [75]:
df[(df['W']>0) & (df['Z']>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

>__This is how you perform OR__

In [76]:
df[(df['W']>0) | (df['Z']>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

>__Reset the index, however the changes are not permanent__

In [77]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

>__Reset the index,and commit the changes__

In [78]:
df.reset_index(inplace=True)

In [79]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [80]:
new_ind = 'CA NY WY OR CO'.split()

In [81]:
new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [82]:
df['States'] = new_ind

In [83]:
df

  index         W         X         Y         Z States
0     A  2.706850  0.628133  0.907969  0.503826     CA
1     B  0.651118 -0.319318 -0.848077  0.605965     NY
2     C -2.018168  0.740122  0.528813 -0.589001     WY
3     D  0.188695 -0.758872 -0.933237  0.955057     OR
4     E  0.190794  1.978757  2.605967  0.683509     CO

>__add a new index - This is only applicable for an existing column__

In [90]:
df.set_index('States', inplace=True)

In [91]:
df

       index         W         X         Y         Z
States
CA         A  2.706850  0.628133  0.907969  0.503826
NY         B  0.651118 -0.319318 -0.848077  0.605965
WY         C -2.018168  0.740122  0.528813 -0.589001
OR         D  0.188695 -0.758872 -0.933237  0.955057
CO         E  0.190794  1.978757  2.605967  0.683509

In [92]:
df.set_index('states')

KeyError: "None of ['states'] are in the columns"

# Pandas - DataFrames Part3

>__zip: store the two lists as pairs__

In [101]:
outside = 'G1 G1 G1 G2 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index= list(zip(outside,inside))
print(hier_index)

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [102]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [103]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [106]:
df = pd.DataFrame(randn(6,2),hier_index, ['A','B'])

In [107]:
df

             A         B
G1 1 -1.005187 -0.741790
   2  0.187125 -0.732845
   3 -1.382920  1.482495
G2 1  0.961458 -2.141212
   2  0.992573  1.192241
   3 -1.046780  1.292765

>__you call each index according to their orders__

In [110]:
df.loc['G1']

          A         B
1 -1.005187 -0.741790
2  0.187125 -0.732845
3 -1.382920  1.482495

In [111]:
df.loc['G1'].loc[1]

A   -1.005187
B   -0.741790
Name: 1, dtype: float64

>__assign names to the indexes__

In [112]:
df.index.names = ['Groups','Num']

In [113]:
df

                   A         B
Groups Num
G1     1   -1.005187 -0.741790
       2    0.187125 -0.732845
       3   -1.382920  1.482495
G2     1    0.961458 -2.141212
       2    0.992573  1.192241
       3   -1.046780  1.292765

In [114]:
df.loc['G2']

            A         B
Num
1    0.961458 -2.141212
2    0.992573  1.192241
3   -1.046780  1.292765

In [116]:
df.loc['G2'].loc[2]

A    0.992573
B    1.192241
Name: 2, dtype: float64

In [117]:
df.loc['G2'].loc[2]['B']

1.1922406372754866

In [118]:
df.loc['G1'].loc[3]['B']

1.48249549608345

>__df.xs('column name')__ : you don't have to follow the order of the columns when accessing values

In [119]:
df.xs(1,level='Num')

               A         B
Groups
G1     -1.005187 -0.741790
G2      0.961458 -2.141212